## Series : is a 1D labelled array and capable of holding any data type .

In [2]:
## Creating a Series

%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/abhishek/.local/lib/python3.10/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in /home/abhishek/.local/lib/python3.10/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/abhishek/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2022.1)
Requirement already satisfied: tzdata>=2022.7 in /home/abhishek/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1 -> 25.1.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np

labels = ['a' , 'b' , 'c']
list = [10,20,30]
arr = np.array([22,33,44])
dict = {1:11 , 2:21 , 3:31}

In [3]:
## creating series 
pd.Series(list , index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(dict )

1    11
2    21
3    31
dtype: int64

DataFrames : Creating DataFrames

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "Country": ["India", "USA", "UK", "Germany"]
}

df = pd.DataFrame(data)

In [4]:
df

      Name  Age  Country
0    Alice   25    India
1      Bob   30      USA
2  Charlie   35       UK
3    David   40  Germany

Selection and Indexing of Columns

In [10]:

df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [11]:
df.iloc[2]

Name       Charlie
Age             35
Country         UK
Name: 2, dtype: object

aDding columns

In [12]:
df["Salary"] = [5000,4000,200,999]

In [13]:
df

      Name  Age  Country  Salary
0    Alice   25    India    5000
1      Bob   30      USA    4000
2  Charlie   35       UK     200
3    David   40  Germany     999

In [14]:
## inserting at specified location
df.insert(loc=1 , column="Pincode" , value=[433,234,644,7651])

In [15]:
df

      Name  Pincode  Age  Country  Salary
0    Alice      433   25    India    5000
1      Bob      234   30      USA    4000
2  Charlie      644   35       UK     200
3    David     7651   40  Germany     999

In [17]:
df.drop("Country" , axis=1)

      Name  Pincode  Age  Salary
0    Alice      433   25    5000
1      Bob      234   30    4000
2  Charlie      644   35     200
3    David     7651   40     999

In [18]:
df

      Name  Pincode  Age  Country  Salary
0    Alice      433   25    India    5000
1      Bob      234   30      USA    4000
2  Charlie      644   35       UK     200
3    David     7651   40  Germany     999

if we use the drop -- that is not going to delete the column , it just shiw thow th copy of data after dropping the column , but original df will be same , 
so use inplace = True to actually delete the column from original df

In [19]:
df.drop("Country" , axis=1 , inplace=True)

In [20]:
df

      Name  Pincode  Age  Salary
0    Alice      433   25    5000
1      Bob      234   30    4000
2  Charlie      644   35     200
3    David     7651   40     999

In [21]:
## dropping a row 
df.drop(3 , inplace= True)

In [22]:
df

      Name  Pincode  Age  Salary
0    Alice      433   25    5000
1      Bob      234   30    4000
2  Charlie      644   35     200

selecting rows and subsets

In [23]:
##selecting rows , need to use loc/iloc

df.loc[0]

Name       Alice
Pincode      433
Age           25
Salary      5000
Name: 0, dtype: object

** Selecting both rows and columns**

In [25]:
df.loc[[0,1]][["Name" , "Salary"]]

    Name  Salary
0  Alice    5000
1    Bob    4000

**Conditionl Selection**

In [30]:
df[(df["Age"]>25 )& (df["Salary"] >200)]

  Name  Pincode  Age  Salary
1  Bob      234   30    4000

**Missing Data**